[["0",{"pageContent":"LangChain is a framework for developing applications powered by language models. We believe that the most powerful","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["1",{"pageContent":"that the most powerful and differentiated applications will not only call out to a language model via an api, but will","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["2",{"pageContent":"via an api, but will also:","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["3",{"pageContent":"Be data-aware: connect a language model to other sources of data","metadata":{"loc":{"lines":{"from":3,"to":3}}}}],["4",{"pageContent":"Be agentic: Allow a language model to interact with its environment","metadata":{"loc":{"lines":{"from":4,"to":4}}}}],["5",{"pageContent":"As such, the LangChain framework is designed with the objective in mind to enable those types of applications.","metadata":{"loc":{"lines":{"from":5,"to":5}}}}],["6",{"pageContent":"There are two main value props the LangChain framework provides:","metadata":{"loc":{"lines":{"from":7,"to":7}}}}],["7",{"pageContent":"Components: LangChain provides modular abstractions for the components neccessary to work with language models.","metadata":{"loc":{"lines":{"from":9,"to":9}}}}],["8",{"pageContent":"with language models. LangChain also has collections of implementations for all these abstractions. The","metadata":{"loc":{"lines":{"from":9,"to":9}}}}],["9",{"pageContent":"abstractions. The components are designed to be easy to use, regardless of whether you are using the rest of the","metadata":{"loc":{"lines":{"from":9,"to":9}}}}],["10",{"pageContent":"are using the rest of the LangChain framework or not.","metadata":{"loc":{"lines":{"from":9,"to":9}}}}],["11",{"pageContent":"Use-Case Specific Chains: Chains can be thought of as assembling these components in particular ways in order to","metadata":{"loc":{"lines":{"from":10,"to":10}}}}],["12",{"pageContent":"ways in order to best accomplish a particular use case. These are intended to be a higher level interface through which","metadata":{"loc":{"lines":{"from":10,"to":10}}}}],["13",{"pageContent":"through which people can easily get started with a specific use case. These chains are also designed to be","metadata":{"loc":{"lines":{"from":10,"to":10}}}}],["14",{"pageContent":"are also designed to be customizable.","metadata":{"loc":{"lines":{"from":10,"to":10}}}}],["15",{"pageContent":"Accordingly, we split the following documentation into those two value props. In this documentation, we go over","metadata":{"loc":{"lines":{"from":11,"to":11}}}}],["16",{"pageContent":"we go over components and use cases at high level and in a language-agnostic way. For language-specific ways of using","metadata":{"loc":{"lines":{"from":11,"to":11}}}}],["17",{"pageContent":"ways of using these components and tackling these use cases, please see the language-specific sections linked at the","metadata":{"loc":{"lines":{"from":11,"to":11}}}}],["18",{"pageContent":"sections linked at the top of the page.","metadata":{"loc":{"lines":{"from":11,"to":11}}}}]]